Repository: kainz/mandos
Catalog: debian/po/*.po
Languages: sv

source: New client option "key_id" is REQUIRED on server
sv: Ny klientinställning ”key_id” KRÄVS på servern

source: A new "key_id" client option is REQUIRED in the clients.conf file, otherwise the client most likely will not reboot unattended. This option:
sv: En ny klientinställning, ”key_id”, KRÄVS i filen clients.conf, annars kommer klienten antagligen inte att starta upp av sig själv. Denna inställning:

source: key_id = <HEXSTRING>
sv: key_id = <HEXADECIMALSTRÄNG>

source: must be added in the file /etc/mandos/clients.conf, right before the "fingerprint" option, for each Mandos client. You must edit that file and add this option for all clients. To see the correct key ID for each client, run this command (on each client):
sv: måste läggas till i filen /etc/mandos/clients.conf, precis ovanför inställningen ”fingerprint”, för varje Mandosklient. Du måste ändra i den filen och lägga till den inställningen för alla klienter. För att se det korrekta nyckel-IDt för varje klient, kör följande kommando (på varje klient):

source: Note: the clients must all also be using GnuTLS 3.6.6 or later; the server cannot serve passwords for both old and new clients!
sv: Observera: Alla klienter måste också använda GnuTLS 3.6.6 eller nyare; servern kan inte ge lösenord till både nya och gamla klienter!

source: Rationale: With GnuTLS 3.6.6, Mandos has been forced to stop using OpenPGP keys as TLS session keys. A new TLS key pair will be generated on each client and will be used as identification, but the key ID of the public key needs to be added to this server, since this will now be used to identify the client to the server.
sv: Förklaring: Med GnuTLS 3.6.6 så har Mandos nödgats att sluta använda OpenPGP-nycklar som TLS-sessionsnycklar. Ett nytt TLS-nyckelpar kommer att genereras på varje klient och kommer att användas för identifiering, men nyckel-IDt för den publika nyckeln måste läggas till på denna server, då denna numera kommer att användas för att identifiera klienten för servern.

source: Bad key IDs have been removed from clients.conf
sv: Dåliga nyckel-IDn har tagits bort från clients.conf

source: Bad key IDs, which were created by a bug in Mandos client 1.8.0, have been removed from /etc/mandos/clients.conf
sv: Dåliga nyckel-IDn, som skapats av en bugg i Mandosklienten 1.8.0, har tagits bort från /etc/mandos/clients.conf

source: New client option "${key_id}" is REQUIRED on server
sv: Ny klientinställning ”${key_id}” KRÄVS på servern

source: A new "key_id" client option is REQUIRED in the server's clients.conf file, otherwise this computer most likely will not reboot unattended. This option:
sv: En ny klientinställning, ”key_id”, KRÄVS i serverns clients.conf-fil, annars kommer denna dator antagligen inte att starta upp av sig själv. Denna inställning:

source: must be added (all on one line!) on the Mandos server host, in the file /etc/mandos/clients.conf, right before the "fingerprint" option for this Mandos client. You must edit that file on that server and add this option.
sv: måste läggas till (allt på en rad!) på Mandosservervärddatorn, i filen /etc/mandos/clients.conf, precis ovanför inställningen ”fingerprint”, för denna Mandosklient. Du måste ändra i den filen och lägga till den inställningen.

source: With GnuTLS 3.6.6, Mandos has been forced to stop using OpenPGP keys as TLS session keys. A new TLS key pair has been generated and will be used as identification, but the key ID of the public key needs to be added to the server, since this will now be used to identify the client to the server.
sv: Med GnuTLS 3.6.6 så har Mandos nödgats att sluta använda OpenPGP-nycklar som TLS-sessionsnycklar. Ett nytt TLS-nyckelpar har genererats och kommer att användas för identifiering, men nyckel-IDt för den publika nyckeln måste läggas till på servern, då detta numera kommer att användas för att identifiera klienten för servern.
